duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_RES_TEST/src/imu/lsm6dso.c
    // 禁用FSM（有限状态机）
    lsm6dso_emb_fsm_enable_t fsm_enable = {0};
	fsm_enable.fsm_enable_a.fsm1_en = PROPERTY_DISABLE;
    lsm6dso_fsm_enable_set(&imu_dev_ctx, &fsm_enable);
    
    //  禁用所有中断
    
    // 禁用INT1所有中断
    lsm6dso_pin_int1_route_t int1_route = {0};
    lsm6dso_pin_int1_route_set(&imu_dev_ctx, &int1_route);
    
    // 禁用INT2所有中断
    lsm6dso_pin_int2_route_t int2_route = {0};
    lsm6dso_pin_int2_route_set(&imu_dev_ctx, &int2_route);
    
    // 禁用嵌入式功能中断
	lsm6dso_pin_int1_route_t int1_config = {0};
    lsm6dso_pin_int1_route_set(&imu_dev_ctx, &int1_config);
    
    lsm6dso_pin_int2_route_t int2_config = {0};
    lsm6dso_pin_int2_route_set(&imu_dev_ctx, &int2_config);
    
    // 关闭FIFO
	lsm6dso_fifo_xl_batch_set(&imu_dev_ctx, LSM6DSO_XL_NOT_BATCHED);
	lsm6dso_fifo_gy_batch_set(&imu_dev_ctx, LSM6DSO_GY_NOT_BATCHED);

	lsm6dso_fifo_mode_t fifo_mode = LSM6DSO_BYPASS_MODE;
    lsm6dso_fifo_mode_set(&imu_dev_ctx, fifo_mode);
    
    // 关键：关闭传感器（最大程度省电）**
    
    // 关闭加速度计（设置ODR为OFF）
    lsm6dso_odr_xl_t xl_odr = LSM6DSO_XL_ODR_OFF;
    lsm6dso_xl_data_rate_set(&imu_dev_ctx, xl_odr);
    
    // 关闭陀螺仪（设置ODR为OFF）
    lsm6dso_odr_g_t gy_odr = LSM6DSO_GY_ODR_OFF;
    lsm6dso_gy_data_rate_set(&imu_dev_ctx, gy_odr);
    
    // 启用陀螺仪睡眠模式
    uint8_t gy_sleep_mode = PROPERTY_ENABLE;
    lsm6dso_gy_sleep_mode_set(&imu_dev_ctx, gy_sleep_mode);
    
    // 设置超低功耗模式
    lsm6dso_xl_hm_mode_t xl_power_mode = LSM6DSO_ULTRA_LOW_POWER_MD;
    lsm6dso_xl_power_mode_set(&imu_dev_ctx, xl_power_mode);
    
    lsm6dso_g_hm_mode_t gy_power_mode = LSM6DSO_GY_HIGH_PERFORMANCE;
    lsm6dso_gy_power_mode_set(&imu_dev_ctx, gy_power_mode);
}

static bool sensor_init(void)
{
	lsm6dso_device_id_get(&imu_dev_ctx, &whoamI);
	if(whoamI != LSM6DSO_ID)
		return false;

	imu_sensor_init();

#ifdef CONFIG_STEP_SUPPORT
	lsm6dso_steps_reset(&imu_dev_ctx);
#endif

	return true;
}

/*@brief Get real time X/Y/Z reading in mg
*
*/
void get_sensor_reading(float *sensor_x, float *sensor_y, float *sensor_z)
{
	uint8_t reg;

	lsm6dso_xl_flag_data_ready_get(&imu_dev_ctx, &reg);
	if(reg)
	{
		memset(data_raw_acceleration.u8bit, 0x00, 3*sizeof(int16_t));
		lsm6dso_acceleration_raw_get(&imu_dev_ctx, data_raw_acceleration.u8bit);
		acceleration_mg[0] = lsm6dso_from_fs4_to_mg(data_raw_acceleration.i16bit[0]);
		acceleration_mg[1] = lsm6dso_from_fs4_to_mg(data_raw_acceleration.i16bit[1]);
		acceleration_mg[2] = lsm6dso_from_fs4_to_mg(data_raw_acceleration.i16bit[2]);
	}

	*sensor_x = acceleration_mg[0];
	*sensor_y = acceleration_mg[1];
	*sensor_z = acceleration_mg[2];
}

#ifdef CONFIG_STEP_SUPPORT
void ReSetImuSteps(void)
{
	lsm6dso_steps_reset(&imu_dev_ctx);

	g_last_steps = 0;
	g_steps = 0;
	g_distance = 0;
	g_calorie = 0;
	
	last_sport.step_rec.timestamp.year = date_time.year;
	last_sport.step_rec.timestamp.month = date_time.month; 
	last_sport.step_rec.timestamp.day = date_time.day;
	last_sport.step_rec.timestamp.hour = date_time.hour;
	last_sport.step_rec.timestamp.minute = date_time.minute;
	last_sport.step_rec.timestamp.second = date_time.second;
	last_sport.step_rec.timestamp.week = date_time.week;
	last_sport.step_rec.steps = g_steps;
	last_sport.step_rec.distance = g_distance;
	last_sport.step_rec.calorie = g_calorie;
	save_cur_sport_to_record(&last_sport);	
}

void GetImuSteps(uint16_t *steps)
{
	lsm6dso_number_of_steps_get(&imu_dev_ctx, steps);
}

void UpdateIMUData(void)
{
	uint16_t steps;
	
	GetImuSteps(&steps);

	g_steps = steps+g_last_steps;
	g_distance = 0.7*g_steps;
	g_calorie = (0.75*65*g_distance)/1000;

#ifdef IMU_DEBUG
	LOGD("g_steps:%d,g_distance:%d,g_calorie:%d", g_steps, g_distance, g_calorie);
#endif

	last_sport.step_rec.timestamp.year = date_time.year;
	last_sport.step_rec.timestamp.month = date_time.month; 
	last_sport.step_rec.timestamp.day = date_time.day;
	last_sport.step_rec.timestamp.hour = date_time.hour;
	last_sport.step_rec.timestamp.minute = date_time.minute;
	last_sport.step_rec.timestamp.second = date_time.second;
	last_sport.step_rec.timestamp.week = date_time.week;
	last_sport.step_rec.steps = g_steps;
	last_sport.step_rec.distance = g_distance;
	last_sport.step_rec.calorie = g_calorie;
	save_cur_sport_to_record(&last_sport);
	
	//StepCheckSendLocationData(g_steps);
}

void GetSportData(uint16_t *steps, uint16_t *calorie, uint16_t *distance)
{
	if(steps != NULL)
		*steps = g_steps;
	if(calorie != NULL)
		*calorie = g_calorie;
	if(distance != NULL)
		*distance = g_distance;
}

/*@Set Sensor sensitivity
*/
void lsm6dso_sensitivity(void)
{ 
	//Set the debounce steps典型值为 0x00（默认）到 0x07，对应连续检测 1~8次 有效步态信号后才会计步。若 buff = 0x03，表示需连续检测到 4次 有效步态信号才会触发一次步数增加。
	uint8_t deb_step = 10; // 10
	lsm6dso_pedo_debounce_steps_set(&imu_dev_ctx, &deb_step);

	//Set the sensitivity of the sensor,该函数用于设置两次有效步之间的最小时间间隔（单位：毫秒），避免因高频振动或快速动作导致单次动作被误判为多步。
	uint8_t delay_time[10] = {0x0f, 0x00}; // 32U
	//Lower Limit is 0 and Upper Limit is 50(32 in Hex), the delay time is 320ms
	// 建议改为 0x000F(~300ms) 或 0x0014(~400ms)，能有效过滤手持抖动等误触发，同时不漏计正常步行。
	// 加速度ODR为26Hz：300ms对应值为15(0x0F),400ms对应值为20(0x14)
	// 加速度ODR为52Hz: 300ms对应值为30(0x1E),400ms对应值为41(0x29)
	// 加速度ODR为104Hz: 300ms对应值为61(0x3D),400ms对应值为81(0x51)
	lsm6dso_pedo_steps_period_set(&imu_dev_ctx, &delay_time);
}
#endif

uint8_t IMU_GetID(void)
{
	uint8_t sensor_id = 0;
	
	lsm6dso_device_id_get(&imu_dev_ctx, &sensor_id);
	return sensor_id;
}

/*@brief Check if a wrist tilt happend
*
* @return If tilt detected, return true, otherwise false
*/
bool is_tilt(void)
{
	bool ret = false;
	lsm6dso_all_sources_t status;

	lsm6dso_all_sources_get(&imu_dev_ctx, &status);
	if(status.fsm_status_a.is_fsm1)
	{ 
		//tilt detected
		ret = true;
	}

	return ret;
}

#ifdef CONFIG_FALL_DETECT_SUPPORT
bool is_tap(void)
{
	bool ret = false;
	lsm6dso_all_sources_t status1;

	lsm6dso_all_sources_get(&imu_dev_ctx, &status1);
	if(status1.tap_src.single_tap)
	{ 
		//tap detected
		ret = true;
	}

	return ret;
}

void tap_detection(void)
{
	tap_count++;
	//LOGD("Tap Num: %d", tap_count);
}

static void fall_scc_confirm_timerout(struct k_timer *timer_id)
{
	if(CheckSCC())
	{
		SCC_check_ok = true;
	}
}
#endif

void IMU_init(struct k_work_q *work_q)
{
#ifdef IMU_DEBUG
	LOGD("IMU_init");
#endif

	get_cur_sport_from_record(&last_sport);
#ifdef IMU_DEBUG
	LOGD("%04d/%02d/%02d last_steps:%d", last_sport.timestamp.year,last_sport.timestamp.month,last_sport.timestamp.day,last_sport.steps);
#endif

#ifdef CONFIG_STEP_SUPPORT
	StepsDataInit(false);
#endif

	imu_work_q = work_q;

	if(init_i2c() != 0)
		return;

	init_gpio();

	imu_dev_ctx.write_reg = platform_write;
	imu_dev_ctx.read_reg = platform_read;
	imu_dev_ctx.handle = i2c_imu;

	imu_check_ok = sensor_init();
	if(!imu_check_ok)
		return;

#ifdef CONFIG_STEP_SUPPORT
	lsm6dso_steps_reset(&imu_dev_ctx); //reset step counter
	lsm6dso_sensitivity();

#endif

#ifdef IMU_DEBUG
	LOGD("IMU_init done!");
#endif
}

#ifdef CONFIG_STEP_SUPPORT
void IMURedrawSteps(void)
{
	if(screen_id == SCREEN_ID_STEPS 
		|| screen_id == SCREEN_ID_SLEEP
		|| screen_id == SCREEN_ID_IDLE)
	{
		scr_msg[screen_id].para |= SCREEN_EVENT_UPDATE_SPORT;
		scr_msg[screen_id].act = SCREEN_ACTION_UPDATE;
	}
}
#endif

void IMUMsgProcess(void)
{
	if(0
		#ifdef CONFIG_FOTA_DOWNLOAD
			|| (fota_is_running())
		#endif
		#ifdef CONFIG_DATA_DOWNLOAD_SUPPORT
			|| (dl_is_running())
		#endif
		#ifdef CONFIG_FACTORY_TEST_SUPPORT
			|| (FactoryTestActived())
		#endif
		)
	{
		return;
	}

	if(int1_event)	//tilt
	{
	#ifdef IMU_DEBUG
		LOGD("int1 evt!");
	#endif
		int1_event = false;

		if(!imu_check_ok || !is_wearing())
			return;

