duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_RES_TEST/src/imu/lsm6dso.c
		if(is_tilt())
		{
		#ifdef IMU_DEBUG
			LOGD("tilt trigger!");
		#endif
			if(lcd_is_sleeping && global_settings.wake_screen_by_wrist)
			{
				sleep_out_by_wrist = true;
				lcd_sleep_out = true;
			}
		}
	#ifdef CONFIG_STEP_SUPPORT	
		else
		{
		#ifdef IMU_DEBUG	
			LOGD("steps trigger!");
		#endif	
			UpdateIMUData();
			imu_redraw_steps_flag = true;
		}
	#endif
	}

#ifdef CONFIG_STEP_SUPPORT	
	if(reset_steps)
	{
		reset_steps = false;

		if(!imu_check_ok)
			return;

		ReSetImuSteps(); 
		imu_redraw_steps_flag = true;
	}

	if(imu_redraw_steps_flag)
	{
		imu_redraw_steps_flag = false;

		if(!imu_check_ok)
			return;

		IMURedrawSteps();
	}
#endif

#ifdef CONFIG_FALL_DETECT_SUPPORT
	if (int2_event && global_settings.fall_check) //fall
	{
	#ifdef IMU_DEBUG
		LOGD("int2 evt!");
	#endif

		int2_event = false;

		if(!imu_check_ok || !is_wearing())
			return;
		
		if(is_tap())
		{
		#if 0 //Tap detection
			k_timer_start(&tap_detect_timer, K_SECONDS(3), K_NO_WAIT);

			if(k_timer_remaining_get(&tap_detect_timer)>=0)
			{
				tap_detection();
			}
		#else
			fall_check_flag = true;
			fall_detection();
			fall_check_flag = false;
		#endif
		}
	}

	if(RUN_FD_FLAG)
	{
		RUN_FD_FLAG = false;
		fall_detection();
	}

	if(fall_result)
	{
		fall_result = false;

	#if 0 // Activity detection
		k_timer_start(&imu_activity_timer, K_SECONDS(3), K_NO_WAIT);

		while(1)
		{
			lsm6dso_all_sources_t status3;

			lsm6dso_all_sources_get(&imu_dev_ctx, &status3);
			if(status3.wake_up_src.wu_ia)
			{
				activity_num++;
				//LOGD("Acitvity detected: %d", activity_num);
			}

			if(k_timer_remaining_get(&imu_activity_timer) == 0)
			{
				break;
			}
		}
	#else
	  #if 1 // SCC detections
		StartSCC();
		k_timer_start(&fall_scc_timer, K_SECONDS(9), K_NO_WAIT);
	  #else
		FallTrigger();
	  #endif
	#endif
	}
	
	if(SCC_check_ok)
	{
		SCC_check_ok = false;

		FallTrigger();
	}
	
	if(fall_check_flag)
	{
		//k_sleep(K_MSEC(3));
	}
#endif
}
#endif/*CONFIG_IMU_SUPPORT*/
